Revit 2027 API
BuiltInFailures.StairRampFailures.StairsAlreadyAttachedToCurrentLevel Property
 Mutistory Stairs already have a Stair attaching to this level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsAlreadyAttachedToCurrentLevel { get; }
Public Shared ReadOnly Property StairsAlreadyAttachedToCurrentLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsAlreadyAttachedToCurrentLevel {
	FailureDefinitionId^ get ();
}
static member StairsAlreadyAttachedToCurrentLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace